import 'package:calender_project/Custom_Widget/Buttons.dart';
import 'package:flutter/material.dart';
class MorningThiker extends StatefulWidget {
  const MorningThiker({Key? key}) : super(key: key);

  @override
  State<MorningThiker> createState() => _MorningThikerState();
}

class _MorningThikerState extends State<MorningThiker> {

  List zikr = [
    'اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمٌُ',
    'قُلْ هُوَ اللَّهُ أَحَدٌ - اللَّهُ الصَّمَدُ - لَمْ يَلِدْ وَلَمْ يُولَدْ - وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ',
    'قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ - مِن شَرِّ مَا خَلَقَ- وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ - وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ - وَمِن شَرِّ حَاسِد إِذَا حَسَدٌ',
    'قُلْ أَعُوذُ بِرَبِّ النَّاسِ - مَلِكِ النَّاسِ - إِلَٰهِ النَّاسِ - مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ - الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ - مِنَ الْجِنَّةِ وَالنَّاس',
    'أصْبَحْنا وَأَصْبَحَ المُلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍقدير، رَبِّ أسْأَلُكَ خَيرَ ما في هذا اليوم وَخَيرَ ما بَعْدَه وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذا اليوم وَشَرِّ ما بَعْدَه، رَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر',
    'اللّهُمَّ بِكَ أَصْبَحْنا، وَبِكَ أَمْسَينا، وَبِكَ نَحْيا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النشورُ',
    'اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي، فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ',
    'اللَّهُمَّ إنِّي أصبَحتُ أُشهِدُك وأُشهِدُ حَمَلةَ عَرشِكَ ومَلائِكَتَك وجميعَ خَلقِكَ، أنَّكَ أنتَ اللهُ لا إلهَ إلَّا أنتَ وأنَّ مُحمَّدًا عبدُكَ ورسولُكَ',
    'اللَّهمَّ ما أصبحَ بي من نعمةٍ أو بأحدٍ من خلقِكَ فمنكَ وحدَكَ لا شريكَ لكَ فلكَ الحمدُ ولكَ الشُّكرُ',
    'اللَّهمَّ عافِني في بدَني اللَّهمَّ عافِني في سمعي اللَّهمَّ عافِني في بصري لا إلهَ إلَّا أنت، اللَّهمَّ إنِّي أعوذُ بِكَ منَ الكُفْرِ والفقرِ اللَّهمَّ إنِّي أعوذُ بكَ من عذابِ القبرِ لا إلهَ إلَّا أنت',
    'حَسْبِيَ اللّهُ لا إلهَ إلاّ هُوَ، عَلَيهِ تَوَكَّلتُ، وَهُوَ رَبُّ العَرْشِ العَظيم',
    'اللهمَّ إني أسألُك العفوَ والعافيةَ، في الدنيا والآخرةِ، اللهمَّ إني أسألُك العفوَ والعافيةَ، في دِيني ودنيايَ وأهلي ومالي، اللهمَّ استُرْ عوراتي وآمِنْ روعاتي واحفظني من بين يدي ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذُ بك أن أُغْتَالَ من تحتي',
    'اللَّهمَّ عالِمَ الغَيبِ والشَّهادةِ، فاطرَ السَّمواتِ والأرضِ، رَبَّ كلِّ شيءٍ ومَليكَهُ، أشهدُ أن لا إلَهَ إلَّا أنتَ، أعوذُ بِكَ مِن شرِّ نفسي وشرِّ الشَّيطانِ وشِركِهِ',
    'بسمِ اللهِ الذي لا يَضرُ مع اسمِه شيءٌ في الأرضِ ولا في السماءِ وهو السميعُ العليمِ',
    'رَضيتُ بِاللهِ رَبَّاً وَبِالإسْلامِ ديناً وَبِمُحَمَّدٍ صلى الله عليه وسلم نَبِيّاً',
    'يا حيُّ يا قيُّومُ، برَحمتِكَ أستَغيثُ، أصلِح لي شأني كُلَّهُ ولا تَكِلني إلى نَفسي طرفةَ عينٍ',
    'أَصبَحْنا على فِطرةِ الإسلامِ وعلى كَلِمةِ الإخلاصِ، وعلى دِينِ نَبيِّنا محمَّدٍ صلَّى اللهُ عليه وسلَّمَ وعلى مِلَّةِ أبِينا إبراهيمَ، حَنيفًا مُسلِمًا، وما كان مِنَ المُشرِكينَ',
    'سُبْحانَ اللهِ وَبِحَمْدِهِ',
    'لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له له الملكُ وله الحمدُ وهو على كلِّ شيءٍ قديرٌ',
    'سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ',
    'اللَّهمَّ إنِّي أسألُكَ عِلمًا نافعًا ورزقًا طيِّبًا وعملًا متقبَّلً',
    'أَعوذُ بِكَلِماتِ اللّهِ التّامّاتِ مِنْ شَرِّ ما خَلَق',
    'أسْتَغْفِرُ اللهَ العَظِيمَ وَأتُوبُ إلَيهِ',
    'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد',
  ];
  List counter = [
    1, 3, 3, 3, 1, 1, 1, 1, 1, 3, 7, 1, 1, 3, 3, 1, 1, 100, 1, 3, 1, 1, 100, 10,
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Theme.of(context).backgroundColor,
        iconTheme: const IconThemeData(color: Color.fromRGBO(215, 190, 105, 1),size: 30),
        elevation: 0,
        actions: [
          IconButton(
              onPressed: (){
                setState(() {
                  counter = [
                    1, 3, 3, 3, 1, 1, 1, 1, 1, 3, 7, 1, 1, 3, 3, 1, 1, 100, 1, 3, 1, 1, 100, 10,
                  ];
                });
              },
              icon: Icon(Icons.restart_alt)),
          PopupMenuButton<int>(
            icon: Icon(
              Icons.more_vert,
              color: Color.fromRGBO(215, 190, 105, 1),
            ),
            color: Theme.of(context).backgroundColor,
            position: PopupMenuPosition.under,
            itemBuilder: (context) => [
              PopupMenuItem<int>(
                value: 1,
                child: Row(
                  children: [
                    const Icon(Icons.settings_outlined,size: 20,),
                    const SizedBox(width:10),
                    const Text("Settings"),
                  ],
                ),
              ),
            ],
            onSelected: (value) async{
              switch (value) {
                case 1:
                  break;
              }
            },
          ),
        ],
      ),
      body: SingleChildScrollView(
        child: Container(
          height: MediaQuery.of(context).size.height,
          width: MediaQuery.of(context).size.width,
          child: Column(
            children: [
              Container(
                height: MediaQuery.of(context).size.height*0.89,
                width: MediaQuery.of(context).size.width,
                child: ListView.builder(
                    itemCount: zikr.length,
                    itemBuilder: (BuildContext ctx,int i){
                      return Card(
                        color: Theme.of(context).backgroundColor,
                        child: Column(
                          children: [
                            ListTile(
                              title: Text(
                                zikr[i],
                                style: TextStyle(fontSize: 20),
                                textAlign: TextAlign.right,
                              ),
                              // subtitle: SizedBox(height: 20,)
                            ),
                            Row(
                              mainAxisAlignment: MainAxisAlignment.center,
                              children: [
                                ButtonAsText(
                                  onPressed: counter[i]!=0?
                                      (){
                                        if(counter[i]>=1 && counter[i]>0){
                                          setState(() {
                                            counter[i]--;
                                          });
                                          print(counter[i]);
                                        }
                                      }
                                      :null,
                                  text: counter[i].toString(),),
                              ],
                            ),
                            SizedBox(height: 5,)
                          ],
                        ),
                      );
                    }
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
